-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 18 2018 г., 03:31
-- Версия сервера: 5.6.34
-- Версия PHP: 5.6.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `network`
--

-- --------------------------------------------------------

--
-- Структура таблицы `friends`
--

CREATE TABLE `friends` (
  `id` int(11) NOT NULL,
  `user_id` int(4) NOT NULL,
  `friend_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `friends`
--

INSERT INTO `friends` (`id`, `user_id`, `friend_id`) VALUES
(1, 1, 4),
(2, 1, 4),
(3, 1, 4),
(4, 1, 4),
(5, 1, 5),
(6, 1, 8),
(7, 1, 7),
(8, 5, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `id` int(11) NOT NULL,
  `data` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `u_from` int(11) NOT NULL,
  `u_to` int(11) NOT NULL,
  `message` text NOT NULL,
  `flag` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `data`, `u_from`, `u_to`, `message`, `flag`) VALUES
(1, '2018-04-17 17:35:37', 1, 1, 'asdasdasdasd222222222222222', 0),
(2, '2018-04-17 17:36:49', 1, 1, '12345', 0),
(3, '2018-04-17 17:37:26', 1, 1, '12345', 0),
(4, '2018-04-17 17:37:42', 1, 1, '12345', 0),
(5, '2018-04-17 17:39:35', 1, 1, '12345', 0),
(6, '2018-04-17 17:39:35', 1, 1, '12345', 0),
(7, '2018-04-17 17:39:44', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(8, '2018-04-17 17:39:44', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(9, '2018-04-17 17:40:02', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(10, '2018-04-17 17:40:12', 1, 1, 'asdasdasdasdasdasdasd', 0),
(11, '2018-04-17 17:40:37', 1, 1, 'asdasdasdasdasdasdasd', 0),
(12, '2018-04-17 17:40:48', 1, 1, 'addddddddddddddddddddddddddddddddddd', 0),
(13, '2018-04-17 17:43:07', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(14, '2018-04-17 17:43:20', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(15, '2018-04-17 17:43:28', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(16, '2018-04-17 17:43:50', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(17, '2018-04-17 17:45:40', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(18, '2018-04-17 17:45:56', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(19, '2018-04-17 17:46:54', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(20, '2018-04-17 17:48:08', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(21, '2018-04-17 17:50:33', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(22, '2018-04-17 17:50:54', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(23, '2018-04-17 18:01:54', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(24, '2018-04-17 18:02:53', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(25, '2018-04-17 18:04:42', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(26, '2018-04-17 18:05:02', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(27, '2018-04-17 18:05:46', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(28, '2018-04-17 18:06:21', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(29, '2018-04-17 18:06:34', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(30, '2018-04-17 18:06:56', 1, 1, 'qqqqqqqqqqqqqqqqqqqqqqqq', 0),
(31, '2018-04-17 18:11:15', 1, 1, '12345', 0),
(32, '2018-04-17 18:15:13', 1, 1, '12345', 0),
(33, '2018-04-17 18:16:25', 1, 1, '12345', 0),
(34, '2018-04-17 18:16:59', 1, 1, '12345', 0),
(35, '2018-04-17 18:17:05', 1, 1, '12345', 0),
(36, '2018-04-17 18:17:56', 1, 1, '12345', 0),
(37, '2018-04-17 18:18:28', 1, 1, '12345', 0),
(38, '2018-04-17 18:18:53', 1, 1, '12345', 0),
(39, '2018-04-17 18:19:01', 1, 1, '12345', 0),
(40, '2018-04-17 18:19:14', 1, 1, '12345', 0),
(41, '2018-04-17 18:20:17', 1, 1, '12345', 0),
(42, '2018-04-17 18:20:54', 1, 1, '12345', 0),
(43, '2018-04-17 18:21:24', 1, 1, '12345', 0),
(44, '2018-04-17 18:21:44', 1, 1, '12345', 0),
(45, '2018-04-17 18:22:05', 1, 1, '12345', 0),
(46, '2018-04-17 18:22:24', 1, 1, '12345', 0),
(47, '2018-04-17 18:22:34', 1, 1, '12345', 0),
(48, '2018-04-17 18:22:49', 1, 1, '12345', 0),
(49, '2018-04-17 18:22:56', 1, 1, '12345', 0),
(50, '2018-04-17 18:23:25', 1, 1, '12345', 0),
(51, '2018-04-17 18:23:45', 1, 1, '12345', 0),
(52, '2018-04-17 18:24:24', 1, 1, '12345', 0),
(53, '2018-04-17 19:03:20', 1, 1, '12345', 0),
(54, '2018-04-17 19:06:27', 1, 1, '12345', 0),
(55, '2018-04-17 19:06:47', 1, 1, '12345', 0),
(56, '2018-04-17 19:07:06', 1, 1, '12345', 0),
(57, '2018-04-17 19:07:28', 1, 1, '12345', 0),
(58, '2018-04-17 19:07:44', 1, 1, '12345', 0),
(59, '2018-04-17 19:08:35', 1, 1, '12345', 0),
(60, '2018-04-17 19:08:50', 1, 1, '12345', 0),
(61, '2018-04-17 19:09:08', 1, 1, '12345', 0),
(62, '2018-04-17 19:09:45', 1, 1, '12345', 0),
(63, '2018-04-17 19:09:58', 1, 1, '12345', 0),
(64, '2018-04-17 19:29:54', 1, 1, '12345', 0),
(65, '2018-04-17 20:15:06', 1, 1, '12345', 0),
(66, '2018-04-17 20:16:00', 1, 1, '12345', 0),
(67, '2018-04-17 20:16:46', 1, 1, '12345', 0),
(68, '2018-04-17 20:17:19', 1, 1, '12345', 0),
(69, '2018-04-17 20:18:34', 1, 1, '12345', 0),
(70, '2018-04-17 20:19:40', 1, 1, '12345', 0),
(71, '2018-04-17 20:20:44', 1, 1, '12345', 0),
(72, '2018-04-17 20:21:09', 1, 1, '12345', 0),
(73, '2018-04-17 20:21:27', 1, 1, '12345', 0),
(74, '2018-04-17 20:21:55', 1, 1, '12345', 0),
(75, '2018-04-17 20:22:48', 1, 1, '12345', 0),
(76, '2018-04-17 20:23:12', 1, 1, '12345', 0),
(77, '2018-04-17 20:23:21', 1, 1, '12345', 0),
(78, '2018-04-17 20:24:13', 1, 1, '12345', 0),
(79, '2018-04-17 20:24:20', 1, 1, '12345', 0),
(80, '2018-04-17 20:24:30', 1, 1, '12345', 0),
(81, '2018-04-17 20:26:43', 1, 1, '12345', 0),
(82, '2018-04-17 20:27:03', 1, 1, '12345', 0),
(83, '2018-04-17 20:27:19', 1, 1, '12345', 0),
(84, '2018-04-17 20:27:52', 1, 1, '12345', 0),
(85, '2018-04-17 20:28:27', 1, 1, '12345', 0),
(86, '2018-04-17 20:28:54', 1, 1, '12345', 0),
(87, '2018-04-17 20:29:13', 1, 1, '12345', 0),
(88, '2018-04-17 20:29:52', 1, 1, '12345', 0),
(89, '2018-04-17 20:31:02', 1, 1, '12345', 0),
(90, '2018-04-17 20:31:46', 1, 1, '12345', 0),
(91, '2018-04-17 20:32:02', 1, 1, '12345', 0),
(92, '2018-04-17 20:32:15', 1, 1, '12345', 0),
(93, '2018-04-17 20:32:43', 1, 1, '12345', 0),
(94, '2018-04-17 20:33:47', 1, 1, '12345', 0),
(95, '2018-04-17 20:34:25', 1, 1, '12345', 0),
(96, '2018-04-17 20:34:48', 1, 1, '12345', 0),
(97, '2018-04-17 20:35:29', 1, 1, '12345', 0),
(98, '2018-04-17 20:36:20', 1, 1, '12345', 0),
(99, '2018-04-17 20:36:56', 1, 1, '12345', 0),
(100, '2018-04-17 20:39:46', 1, 1, '12345', 0),
(101, '2018-04-17 20:42:35', 1, 1, '12345', 0),
(102, '2018-04-17 21:03:30', 1, 1, '12345', 0),
(103, '2018-04-17 21:04:50', 1, 1, '12345', 0),
(104, '2018-04-17 21:41:02', 1, 1, '12345', 0),
(105, '2018-04-17 21:41:17', 1, 1, '12345', 0),
(106, '2018-04-17 21:41:56', 1, 1, '12345', 0),
(107, '2018-04-17 21:42:56', 1, 1, '12345', 0),
(108, '2018-04-17 21:44:38', 1, 1, '12345', 0),
(109, '2018-04-17 21:45:12', 1, 1, '12345', 0),
(110, '2018-04-17 21:45:41', 1, 1, '12345', 0),
(111, '2018-04-17 21:46:10', 1, 1, '12345', 0),
(112, '2018-04-17 21:46:22', 1, 1, '12345', 0),
(113, '2018-04-17 21:46:34', 1, 1, '12345', 0),
(114, '2018-04-17 21:47:07', 1, 1, '12345', 0),
(115, '2018-04-17 21:47:32', 1, 1, '12345', 0),
(116, '2018-04-17 21:47:51', 1, 1, '12345', 0),
(117, '2018-04-17 21:49:18', 1, 1, '12345', 0),
(118, '2018-04-17 21:49:43', 1, 1, '12345', 0),
(119, '2018-04-17 21:50:31', 1, 1, '12345', 0),
(120, '2018-04-17 21:52:32', 1, 1, '12345', 0),
(121, '2018-04-17 21:52:56', 1, 1, '12345', 0),
(122, '2018-04-17 21:53:11', 1, 1, '12345', 0),
(123, '2018-04-17 21:53:38', 1, 1, '12345', 0),
(124, '2018-04-17 21:53:52', 1, 1, '12345', 0),
(125, '2018-04-17 21:54:16', 1, 1, '12345', 0),
(126, '2018-04-17 21:54:57', 1, 1, '12345', 0),
(127, '2018-04-17 21:55:08', 1, 1, '12345', 0),
(128, '2018-04-17 21:57:43', 1, 1, '12345', 0),
(129, '2018-04-17 21:59:13', 1, 1, '12345', 0),
(130, '2018-04-17 22:30:04', 1, 1, '12345', 0),
(131, '2018-04-17 22:33:42', 1, 1, '12345', 0),
(132, '2018-04-17 22:35:24', 1, 1, '12345', 0),
(133, '2018-04-17 22:37:08', 1, 1, '12345', 0),
(134, '2018-04-17 22:37:13', 1, 1, '12345', 0),
(135, '2018-04-17 22:38:43', 1, 1, '12345', 0),
(136, '2018-04-17 22:39:19', 1, 1, '12345', 0),
(137, '2018-04-17 22:41:46', 1, 1, '12345', 0),
(138, '2018-04-17 22:44:09', 1, 1, '12345', 0),
(139, '2018-04-17 22:44:31', 1, 1, '12345', 0),
(140, '2018-04-17 22:45:08', 1, 1, '12345', 0),
(141, '2018-04-18 00:04:06', 1, 1, '12345', 0),
(142, '2018-04-18 00:07:42', 1, 1, '12345', 0),
(143, '2018-04-18 00:08:24', 1, 1, '12345', 0),
(144, '2018-04-18 00:08:25', 1, 1, '12345', 0),
(145, '2018-04-18 00:08:37', 1, 1, '12345', 0),
(146, '2018-04-18 00:09:51', 1, 1, '12345', 0),
(147, '2018-04-18 00:10:11', 1, 1, '12345', 0),
(148, '2018-04-18 00:12:56', 1, 1, '12345', 0),
(149, '2018-04-18 00:13:22', 1, 1, '12345', 0),
(150, '2018-04-18 00:18:29', 1, 1, '12345', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `content` text NOT NULL,
  `date` varchar(32) NOT NULL,
  `image` text NOT NULL,
  `user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `posts`
--

INSERT INTO `posts` (`id`, `title`, `description`, `content`, `date`, `image`, `user_id`) VALUES
(4, 'Подсистема UBUNTU на ОС WINDOWS 10', '', 'Windows 10 позволит запускать в контейнере UbuntuСегодня в 18:00 по московскому времени началась конференция Microsoft Build 2016 для разработчиков по всему миру и на ней ожидается много анонсов и новостей.Это подтверждает некоторые слухи о том, что Microsoft и Canonical позволят запускать прямо в Windows 10 операционную систему Ubuntu Linux, правда о полноценном графическом интерфейсе ОС скорее всего речи не идет, будет доступна командная строка, впрочем уже сегодня-завтра мы все узнаем.Интересно было бы увидеть подсистему Linux на Windows 10 Mobile, это могло бы стать одним из возможных путей запуска Android-приложений, также в случае наличия графической оболочки у Ubuntu на мобильной Windows 10, можно было бы объединиться для продвижения смартфонов с возможностью работать на ОС от Microsoft или на ОС от Canonical.', '2018-04-06', '', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `first_name` text NOT NULL,
  `last_name` text NOT NULL,
  `email` text NOT NULL,
  `login` text NOT NULL,
  `password` text NOT NULL,
  `avatar` text NOT NULL,
  `active` tinyint(1) NOT NULL,
  `status` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `first_name`, `last_name`, `email`, `login`, `password`, `avatar`, `active`, `status`) VALUES
(1, 'Никита', 'Золовкин', '', 'admin', '1234', 'file-1523904061.jpg', 1, 'admin'),
(3, 'qwer', 'qwer', 'qwer', 'qwer', 'qwer', '', 0, ''),
(4, 'Name', 'Lastname', 'email@email.com', 'user', 'qwer', 'file-1523052504.jpg', 0, ''),
(5, 'q', 'q', 'q', 'q', 'q', 'file-1523624797.jpg', 0, ''),
(6, 'qqq', 'qqq', 'qqq@qmail.com', 'qqq', 'qqq', '', 0, ''),
(7, 'qqq', 'qqq', 'qqq@qmail.com', 'qqq', 'qqq', '', 0, ''),
(8, 'qqq', 'qqq', 'qqq', 'qqq', 'qqq', '', 0, ''),
(9, 'Иван', 'Иванов', 'ivan@gmail.com', 'ivan', '1234', '', 0, '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `friends`
--
ALTER TABLE `friends`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `friends`
--
ALTER TABLE `friends`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;
--
-- AUTO_INCREMENT для таблицы `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
